#+title: WCWC - The Wire-Cell Workstation Cluster
#+setupfile: ~/org/setup.org
#+setupfile: ~/org/setup-topic.org
#+setupfile: ~/org/setup-darksun.org
#+options: toc:t

** Initialize Spack area
:PROPERTIES:
:CUSTOM_ID: spack-init
:END:

All WCWC software that is not provided by the OS is provided in a single directory tree.  By default this is ~/wcwc~.  The part managed by Spack is organized as ~/wcwc/spack/<name>/{repo,scope,install}~.  The ~<name>~ is one coarse-grained block of a software stack.  The ~base~ is Spack itself, depending on that is ~wirecell~.  A separate branch includes the dependency chain: ~nusoft, art, lartsoft~.  From there, per-experiment branches are expected.  The ~repo/~ sub-directory holds the Spack ~package.py~ files for building source (~base/repo/~ also holds all of Spack source).  The ~scope/~ directory holds Spack configuration files to narrow to a portion of the coarse dependency chain.  Finally, ~install/~ holds the built, installed packages.  See [[https://spack.readthedocs.io/en/latest/configuration.html#configuration-scopes][configuration scopes]], [[https://spack.readthedocs.io/en/latest/chain.html][chaining Spack installations]] and [[https://spack.readthedocs.io/en/latest/repositories.html][Spack repos]] for more info.

The ~/wcwc~ area is managed with the ~wcwc~ command:

#+begin_src shell :results verbatim :exports both
wcwc
#+end_src

#+RESULTS:
#+begin_example
Usage: wcwc [OPTIONS] COMMAND [ARGS]...

Options:
  -p, --prefix TEXT  Specify WCWC Spack installation prefix (def=/wcwc)
  -c, --config TEXT  Specify a config file
  -h, --help         Show this message and exit.

Commands:
  check-os      Check if current running OS is supported
  install-repo  Install the named repo.
  junk          Ignore this cmd, it is to test out click stuff.
  list-oses     Print names of supported operating systems, one per line.
  list-scopes   List known scopes
  prepare-os    Install OS packages
  spack         Wrapper around calling spack.
#+end_example

To install the files for each known ~<name>~ this sub command is available:

#+begin_src shell :results verbatim :exports both
wcwc install-repo --help
#+end_src

#+RESULTS:
#+begin_example
Usage: wcwc install-repo [OPTIONS]

  Install the named repo.

  If recurs is True, upstreams with their default configuration will be
  installed.

  If the repo name is not known and is new then at least URL is required.

Options:
  -r, --recurs          recurs over upstreams, if any (default=False)
  -f, --force           force overwriting (default=False)
  -t, --tag TEXT        override default git tag
  -u, --url TEXT        override default git url
  -U, --upstreams TEXT  override upstreams (comma separated list)
  -n, --name TEXT       give name of repo (default=base)
  -h, --help            Show this message and exit.
#+end_example

When the defaults are acceptable, a recursive install is possible

#+begin_example
wcwc install-repo -r wire-cell
#+end_example

A configuration file will be written to ~/wcwc/wcwc.yaml~.  It may be modified and future ~wcwc~ commands will respect any changes.  A non-standard prefix and/or configuration file may also be used:

#+begin_example
wcwc -p /path/to/wcwc -c /other/path/to/wcwc.cfg install-repo -r wire-cell
#+end_example

With no ~<name>~ given, the base Spack will be installed.

#+begin_example
wcwc install-repo
#+end_example

Once the base Spack is installed, the ~spack~ command can be run in several ways:
#+begin_example
$ wcwc spack [...]

$ /wcwc/spack/base/repo/bin/spack 

$ source /wcwc/spack/base/repo/share/spack/setup-env.sh 
$ spack [...]
#+end_example
Further examples of this command will simply use ~spack~ with the assumption any of the above methods are used.  A particular method will be noted if it is required for some particular case.

Spack configuration can be narrowed to a scope in a few ways:
#+begin_example
$ wcwc spack --scope wirecell [....]

$ wcwc spack -C /wcwc/spack/wirecell/scope [....]

$ spack -C /wcwc/spack/wirecell/scope [....]

$ SPACK_USER_CONFIG_PATH=/srv/bv/wcwc/spack/wirecell/scope \
  spack [...] 
#+end_example
The ~wcwc spack~ variants will also honor ~SPACK_USER_CONFIG_PATH~.
We will see other uses of "scope" after introducing Spack Environments.  

The install can be tested to see if the ~/wcwc~ area is properly configured: 
#+begin_example
$ spack config get | grep -A 1 install_tree:
#+end_example
And insure you get back the expected install area.  And here is a simple package installation test:
#+begin_example
$ spack install zlib
#+end_example


* Meta :noexport:

#+begin_src sh :results output drawer
cat ~/.ssh/id_hierocles.pub ~/.ssh/id_rsa.pub > wcwc.pub
scp wcwc.pub wcwc.org wcwc.html wcwc.pdf wcwc@lycastus.bnl:public_html/
scp wcwc.pub wcwc.org wcwc.html wcwc.pdf hierocles.bnl:public_html/wire-cell/docs/
#+end_src

#+RESULTS:
:results:
:end:





# Local Variables:
# eval: (setq org-html-self-link-headlines t)
# End:
